//
// Created by ChijinLoujue on 2021/2/2.
//

/*
【华为】【From 李扬】杨振鑫，您好！恭喜您通过了华为公司的简历筛选。特邀您进行上机考试。具体如下：
类型：软件开发类机考
        时间：2021年2月2日~2月3日，具体时段自行安排
        时长：90分钟
题型：2道编程题，总分400，通过分160
        地点：不限，任何带摄像头的电脑均可
        链接：https://exam.nowcoder.com/cts/17075243/summary?id=2FBC03B2B994CFC0（答题开始后，一次有效）
账号：18121（浏览器打开链接后，账号会自动填写，请核对）
【温馨提示】1、请使用最新版chrome浏览器作答（72版本及以上），考试过程中需开启摄像头、屏幕录制及手机监控，如果监控异常会进行风险标识，可能会影响您的成绩。2、编程题支持本地IDE编码后复制粘贴至考试页面，不做跳出限制。请勿浏览除本地编译器以外的其他页面，否则会进行风险标识。3、答题前请注意查看示例（计入考试时长），代码完成后请务必点击【保存并调试】按扭，否则答案不作保存，不限制提交运行次数（以提交中最高得分计分），调试完成点击【提交本题型】按钮，最后交卷。一定要注意审题，特别是题目要求的输入输出格式。4、考试时允许使用草稿纸，请提前准备纸笔。考试过程中允许上厕所等短暂离开，但请控制离开时间。5、考试期间如遇到断电、断网、死机等问题，可以关闭浏览器重新打开试卷链接即可继续做题。6、请注意填写的考生信息与简历保持一致。
您预留的邮箱：chijinloujue@qq.com
*/


// 本题为考试单行多行输入输出规范示例，无需提交，不计分。
//#include <iostream>
//using namespace std;
//int main() {
//    int a,b;
//    while(cin >> a >> b)// 注意，如果输入是多个测试用例，请通过while循环处理多个测试用例
//        cout << a+b << endl;
//}